kirill = {"А": ".-", "Б": "-...", "В": ".--", "Г": "--.", "Д": "-..", "Е": ".", "Ё": ".", "Ж": "...-", "З": "--..",
          "И": "..", "Й": ".---", "К": "-.-", "Л": ".-..", "М": "--", "Н": "-.", "О": "---", "П": ".--.", "Р": ".-.",
          "С": "...", "Т": "-", "У": "..-", "Ф": "..-.", "Х": "....", "Ц": "-.-.", "Ч": "---.", "Ш": "----",
          "Щ": "--.-", "Ъ": "--.--", "Ы": "-.--", "Ь": "-..-", "Э": "..-..", "Ю": "..--", "Я": ".-.-", "1": ".----",
          "2": "..---", "3": "...--", "4": "....-", "5": ".....", "6": "-....", "7": "--...", "8": "---..",
          "9": "----.", ".": "......", ",": ".-.-.-", ":": "---...", ";": "-.-.-", "'": ".----.", '"': ".-..-.",
          "-": "-....-", "/": "-..-.", "?": "..--..", "!": "--..--"}

latin_dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.',
              'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---',
              'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---',
              'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-',
              'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--',
              'Z': '--..', '1': '.----', '2': '..---', '3': '...--',
              '4': '....-', '5': '.....', '6': '-....', '7': '--...',
              '8': '---..', '9': '----.', '0': '-----', ',': '--..--',
              '.': '.-.-.-', '?': '..--..', '/': '-..-.', '-': '-....-',
              '(': '-.--.', ')': '-.--.-', '!': '--..--', ':': '---...',
              ';': '-.-.-.', '_': '..--.-', '+': '.-.-.', '"': '.-..-.'}


def encode_to_morse(text):
    text = text.upper().split()
    res = ""
    lang = language().lower()
    if lang == "eng":
        for word in text:
            res += " ".join([latin_dict[char] for char in word]) + " "
        return res
    elif lang == "rus":
        for word in text:
            res += " ".join([kirill[char] for char in word]) + " "
        return res


def decode_from_morse(code):
    s = ""
    lang = language().lower()
    if lang == "rus":
        for symbol in code.split():
            for pair in kirill.items():
                if symbol == pair[1]:
                    s += pair[0]
        return s
    elif lang == "eng":
        for symbol in code.split():
            for pair in latin_dict.items():
                if symbol == pair[1]:
                    s += pair[0]
        return s


def language():
    return input("Русский или английский язык ?" + "\n" + "Выберите rus или eng" + "\n")


def main():
    s = ""
    while s != "exit":
        a = input("Закодировать или декодировать сообщение ?" + "\n" + "Выберите 1 или 2" + "\n")
        if a == "1":
            print(f"Закодированный текст: {encode_to_morse(input("Введите текст для кодирования в азбуку Морзе: "))}")
            print()
            s = input('Если желаете продолжить, нажмите Enter, иначе введите "exit": ')
            print("\n")
        if a == "2":
            print(f"Расшифрованное сообщение: {decode_from_morse(input("Пожалуйста, введите код сообщения,"
                                                                       " разделяя символы пробелами: "))}")
            print()
            s = input('Если желаете продолжить, нажмите Enter, иначе введите "exit": ')
            print("\n")
